* Day 2: Red-Nosed Reports

Fortunately, the first location The Historians want to search isn't a long walk
from the Chief Historian's office.

While the Red-Nosed Reindeer nuclear fusion/fission plant appears to contain no
sign of the Chief Historian, the engineers there run up to you as soon as they
see you. Apparently, they still talk about the time Rudolph was saved through
molecular synthesis from a single electron.

They're quick to add that - since you're already here - they'd really appreciate
your help analyzing some unusual data from the Red-Nosed reactor. You turn to
check if The Historians are waiting for you, but they seem to have already
divided into groups that are currently searching every corner of the facility.
You offer to help with the unusual data.

The unusual data (your puzzle input) consists of many reports, one report per
line. Each report is a list of numbers called levels that are separated by
spaces. For example:

7 6 4 2 1

1 2 7 8 9

9 7 6 2 1

1 3 2 4 5

8 6 4 4 1

1 3 6 7 9

This example data contains six reports each containing five levels.

The engineers are trying to figure out which reports are safe. The Red-Nosed
reactor safety systems can only tolerate levels that are either gradually
increasing or gradually decreasing. So, a report only counts as safe if both of
the following are true:

The levels are either all increasing or all decreasing.

Any two adjacent levels differ by at least one and at most three.

In the example above, the reports can be found safe or unsafe by checking those rules:

- 7 6 4 2 1: Safe because the levels are all decreasing by 1 or 2.
- 1 2 7 8 9: Unsafe because 2 7 is an increase of 5.
- 9 7 6 2 1: Unsafe because 6 2 is a decrease of 4.
- 1 3 2 4 5: Unsafe because 1 3 is increasing but 3 2 is decreasing.
- 8 6 4 4 1: Unsafe because 4 4 is neither an increase or a decrease.
- 1 3 6 7 9: Safe because the levels are all increasing by 1, 2, or 3.

So, in this example, 2 reports are safe.

Analyze the unusual data from the engineers. How many reports are safe?

#+begin_src ruby
  data = text = File.read("data.txt")

  safe = 0
  data.each_line do |l|
    levels = l.split
    inc = false
    dec = false
    safe_line = true

    while levels.length > 1 and safe_line
      l0 = levels[0].to_i
      l1 = levels[1].to_i
      if l0 < l1
        d = l1 - l0
        if dec or d < 1 or d > 3
          safe_line = false
        else
          inc = true
        end
      else
        d = l0 - l1
        if inc or d < 1 or d > 3
          safe_line = false
        else
          dec = true
        end
      end
      levels = levels.drop(1)
    end

    safe += 1 if safe_line
  end

  safe
#+end_src

#+RESULTS:
: 213

** Part Two

The engineers are surprised by the low number of safe reports until they realize
they forgot to tell you about the Problem Dampener.

The Problem Dampener is a reactor-mounted module that lets the reactor safety
systems tolerate a single bad level in what would otherwise be a safe report.
It's like the bad level never happened!

Now, the same rules apply as before, except if removing a single level from an
unsafe report would make it safe, the report instead counts as safe.

More of the above example's reports are now safe:

- 7  6  4  2  1: Safe without removing any level.
- 1  2  7  8  9: Unsafe regardless of which level is removed.
- 9  7  6  2  1: Unsafe regardless of which level is removed.
- 1 *3* 2  4  5: Safe by removing the second level, 3.
- 8  6 *4* 4  1: Safe by removing the third level, 4.
- 1  3  6  7  9: Safe without removing any level.

Thanks to the Problem Dampener, 4 reports are actually safe!

Update your analysis by handling situations where the Problem Dampener can
remove a single level from unsafe reports. How many reports are now safe?

#+begin_src ruby
  data = File.read("data.txt")

  safe = 0
  dbg = ""

  def safe_line?( levels )
    inc = false
    dec = false

    for i in 0..(levels.length-2) do
               l0 = levels[i]
               l1 = levels[i+1]
               if l0 < l1
                 d = l1 - l0
                 if dec or d < 1 or d > 3
                   return i
                 else
                   inc = true
                 end
               else
                 d = l0 - l1
                 if inc or d < 1 or d > 3
                   return i
                 else
                   dec = true
                 end
               end
             end
      return -1
    end


    # brute force attempt
    # If levels are not safe remove one item and check again and do this for
    # each single item/level
    safe = 0
    data.each_line do |l|
      levels = l.split.map(&:to_i)
      linesafe = false
      dbg += "Line #{levels.to_s} "
      s = safe_line?( levels )
      if s == -1
        safe += 1
        dbg += "-> safe\n"
      else
        i = 0
        while i < levels.length and linesafe != true do
          levels1 = levels.dup
          levels1.delete_at( i )
          s1 = safe_line?( levels1 )
          if s1 == -1
            safe += 1
            dbg += "->rem. #{i} -> #{levels1.to_s} -> safe\n"
            linesafe = true
          end
          i += 1
        end
        if not linesafe
          dbg += " -> unsafe\n"
        end
      end
    end

  #safe
  "#{dbg}\n\n#{safe}"
#+end_src

#+RESULTS:
#+begin_example
Line [10, 11, 13, 16, 15] ->rem. 3 -> [10, 11, 13, 15] -> safe
Line [3, 6, 9, 10, 11, 12, 12] ->rem. 5 -> [3, 6, 9, 10, 11, 12] -> safe
Line [43, 46, 49, 52, 54, 58] ->rem. 5 -> [43, 46, 49, 52, 54] -> safe
Line [59, 60, 61, 63, 65, 68, 75] ->rem. 6 -> [59, 60, 61, 63, 65, 68] -> safe
Line [60, 62, 63, 65, 63, 66, 69, 71] ->rem. 4 -> [60, 62, 63, 65, 66, 69, 71] -> safe
Line [80, 83, 85, 88, 85, 87, 84]  -> unsafe
Line [30, 31, 32, 31, 33, 33]  -> unsafe
Line [9, 11, 14, 12, 16] ->rem. 3 -> [9, 11, 14, 16] -> safe
Line [38, 39, 40, 43, 42, 45, 50]  -> unsafe
Line [58, 61, 63, 63, 66] ->rem. 2 -> [58, 61, 63, 66] -> safe
Line [15, 17, 18, 20, 20, 21, 23, 21]  -> unsafe
Line [17, 19, 22, 24, 25, 25, 28, 28]  -> unsafe
Line [60, 63, 66, 67, 67, 69, 73]  -> unsafe
Line [42, 44, 44, 45, 52]  -> unsafe
Line [22, 23, 27, 30, 32, 34]  -> unsafe
Line [22, 23, 25, 26, 28, 31, 35, 33] ->rem. 6 -> [22, 23, 25, 26, 28, 31, 33] -> safe
Line [11, 14, 16, 19, 22, 26, 26]  -> unsafe
Line [38, 41, 44, 48, 52]  -> unsafe
Line [15, 17, 21, 24, 26, 33]  -> unsafe
Line [50, 51, 54, 61, 62, 65, 68]  -> unsafe
Line [37, 40, 42, 44, 49, 50, 47]  -> unsafe
Line [6, 7, 8, 14, 14]  -> unsafe
Line [17, 20, 25, 27, 31]  -> unsafe
Line [68, 69, 70, 73, 76, 81, 87]  -> unsafe
Line [83, 81, 82, 83, 85, 87, 90, 92] ->rem. 0 -> [81, 82, 83, 85, 87, 90, 92] -> safe
Line [52, 51, 54, 56, 58, 57]  -> unsafe
Line [93, 90, 91, 92, 92]  -> unsafe
Line [12, 9, 10, 12, 14, 15, 16, 20]  -> unsafe
Line [26, 24, 26, 27, 33]  -> unsafe
Line [17, 15, 14, 17, 19]  -> unsafe
Line [99, 96, 97, 96, 97, 99, 98]  -> unsafe
Line [9, 7, 5, 8, 8]  -> unsafe
Line [59, 58, 61, 63, 62, 64, 68]  -> unsafe
Line [24, 23, 25, 28, 26, 28, 35]  -> unsafe
Line [93, 90, 92, 94, 94, 95]  -> unsafe
Line [72, 69, 72, 73, 76, 77, 77, 75]  -> unsafe
Line [46, 45, 47, 47, 49, 49]  -> unsafe
Line [61, 60, 63, 64, 64, 66, 70]  -> unsafe
Line [35, 32, 35, 36, 37, 37, 40, 47]  -> unsafe
Line [6, 3, 6, 9, 13, 15, 16]  -> unsafe
Line [29, 28, 31, 33, 35, 36, 40, 38]  -> unsafe
Line [22, 21, 25, 26, 26]  -> unsafe
Line [51, 50, 51, 54, 58, 60, 64]  -> unsafe
Line [83, 82, 86, 88, 95]  -> unsafe
Line [79, 76, 83, 86, 89]  -> unsafe
Line [19, 17, 23, 25, 26, 25]  -> unsafe
Line [19, 18, 21, 28, 30, 31, 31]  -> unsafe
Line [72, 70, 72, 73, 74, 77, 82, 86]  -> unsafe
Line [40, 39, 40, 47, 53]  -> unsafe
Line [7, 7, 9, 12, 15, 18, 19] ->rem. 0 -> [7, 9, 12, 15, 18, 19] -> safe
Line [57, 57, 59, 62, 63, 65, 63]  -> unsafe
Line [57, 57, 59, 62, 65, 66, 66]  -> unsafe
Line [26, 26, 29, 31, 33, 34, 38]  -> unsafe
Line [44, 44, 47, 50, 52, 59]  -> unsafe
Line [19, 19, 21, 20, 22, 25, 27]  -> unsafe
Line [76, 76, 79, 77, 74]  -> unsafe
Line [61, 61, 64, 63, 65, 65]  -> unsafe
Line [80, 80, 81, 83, 85, 83, 87]  -> unsafe
Line [63, 63, 66, 67, 65, 71]  -> unsafe
Line [48, 48, 48, 50, 51, 53, 56, 58]  -> unsafe
Line [17, 17, 17, 18, 17]  -> unsafe
Line [66, 66, 68, 68, 68]  -> unsafe
Line [78, 78, 79, 79, 83]  -> unsafe
Line [1, 1, 3, 4, 7, 8, 8, 13]  -> unsafe
Line [14, 14, 18, 20, 21]  -> unsafe
Line [22, 22, 25, 27, 31, 28]  -> unsafe
Line [32, 32, 34, 38, 38]  -> unsafe
Line [49, 49, 51, 52, 54, 56, 60, 64]  -> unsafe
Line [85, 85, 89, 91, 93, 94, 99]  -> unsafe
Line [28, 28, 29, 30, 35, 38, 39]  -> unsafe
Line [10, 10, 11, 18, 20, 22, 25, 24]  -> unsafe
Line [87, 87, 90, 96, 96]  -> unsafe
Line [47, 47, 48, 51, 58, 62]  -> unsafe
Line [7, 7, 8, 9, 11, 12, 18, 25]  -> unsafe
Line [70, 74, 75, 77, 79, 82] ->rem. 0 -> [74, 75, 77, 79, 82] -> safe
Line [27, 31, 32, 33, 34, 35, 37, 34]  -> unsafe
Line [45, 49, 52, 55, 57, 60, 62, 62]  -> unsafe
Line [39, 43, 44, 47, 50, 51, 55]  -> unsafe
Line [42, 46, 49, 50, 53, 54, 59]  -> unsafe
Line [5, 9, 12, 10, 12]  -> unsafe
Line [69, 73, 74, 73, 74, 75, 72]  -> unsafe
Line [76, 80, 82, 84, 81, 84, 84]  -> unsafe
Line [29, 33, 31, 33, 35, 39]  -> unsafe
Line [49, 53, 54, 55, 56, 57, 54, 59]  -> unsafe
Line [42, 46, 46, 47, 50, 52]  -> unsafe
Line [65, 69, 69, 72, 70]  -> unsafe
Line [72, 76, 76, 78, 80, 82, 83, 83]  -> unsafe
Line [45, 49, 52, 53, 53, 57]  -> unsafe
Line [37, 41, 42, 45, 45, 50]  -> unsafe
Line [56, 60, 62, 63, 67, 68]  -> unsafe
Line [35, 39, 40, 43, 46, 49, 53, 51]  -> unsafe
Line [7, 11, 15, 17, 20, 21, 24, 24]  -> unsafe
Line [2, 6, 7, 9, 13, 17]  -> unsafe
Line [43, 47, 50, 52, 56, 59, 64]  -> unsafe
Line [12, 16, 19, 22, 28, 30, 33]  -> unsafe
Line [43, 47, 48, 53, 54, 57, 55]  -> unsafe
Line [83, 87, 88, 95, 95]  -> unsafe
Line [57, 61, 63, 64, 66, 73, 75, 79]  -> unsafe
Line [57, 61, 64, 69, 71, 76]  -> unsafe
Line [86, 93, 95, 96, 97, 99] ->rem. 0 -> [93, 95, 96, 97, 99] -> safe
Line [30, 35, 37, 39, 38]  -> unsafe
Line [11, 17, 19, 20, 20]  -> unsafe
Line [20, 26, 29, 32, 36]  -> unsafe
Line [68, 73, 74, 77, 80, 87]  -> unsafe
Line [37, 42, 44, 43, 46, 49, 50, 51]  -> unsafe
Line [48, 55, 58, 56, 57, 58, 57]  -> unsafe
Line [36, 42, 39, 42, 43, 44, 44]  -> unsafe
Line [20, 25, 28, 25, 27, 29, 31, 35]  -> unsafe
Line [14, 20, 23, 21, 22, 23, 25, 32]  -> unsafe
Line [77, 82, 83, 83, 84, 86, 88, 91]  -> unsafe
Line [30, 36, 37, 40, 40, 42, 43, 42]  -> unsafe
Line [15, 21, 22, 25, 27, 27, 28, 28]  -> unsafe
Line [46, 52, 55, 55, 56, 58, 62]  -> unsafe
Line [15, 22, 23, 23, 24, 27, 34]  -> unsafe
Line [22, 29, 30, 34, 37]  -> unsafe
Line [5, 11, 14, 18, 20, 18]  -> unsafe
Line [7, 12, 16, 18, 21, 22, 22]  -> unsafe
Line [39, 45, 47, 51, 54, 56, 58, 62]  -> unsafe
Line [57, 63, 67, 70, 71, 76]  -> unsafe
Line [72, 79, 84, 86, 87, 90]  -> unsafe
Line [80, 85, 92, 93, 96, 93]  -> unsafe
Line [72, 78, 83, 84, 84]  -> unsafe
Line [46, 52, 55, 57, 58, 64, 68]  -> unsafe
Line [69, 75, 78, 80, 87, 93]  -> unsafe
Line [89, 88, 85, 82, 80, 77, 74, 75] ->rem. 6 -> [89, 88, 85, 82, 80, 77, 75] -> safe
Line [14, 13, 11, 9, 8, 5, 2, 2] ->rem. 6 -> [14, 13, 11, 9, 8, 5, 2] -> safe
Line [93, 91, 88, 86, 83, 79] ->rem. 5 -> [93, 91, 88, 86, 83] -> safe
Line [39, 37, 35, 34, 32, 30, 28, 21] ->rem. 7 -> [39, 37, 35, 34, 32, 30, 28] -> safe
Line [52, 51, 52, 49, 47, 45] ->rem. 2 -> [52, 51, 49, 47, 45] -> safe
Line [96, 95, 94, 93, 90, 88, 91, 93]  -> unsafe
Line [35, 34, 36, 35, 34, 33, 33]  -> unsafe
Line [39, 37, 38, 37, 34, 32, 31, 27]  -> unsafe
Line [24, 23, 24, 22, 16]  -> unsafe
Line [60, 57, 57, 54, 53, 52, 50, 48] ->rem. 1 -> [60, 57, 54, 53, 52, 50, 48] -> safe
Line [36, 35, 34, 33, 33, 32, 31, 34]  -> unsafe
Line [76, 74, 71, 71, 71]  -> unsafe
Line [32, 29, 28, 26, 23, 23, 19]  -> unsafe
Line [91, 88, 86, 86, 83, 77]  -> unsafe
Line [42, 41, 39, 35, 33]  -> unsafe
Line [27, 24, 22, 18, 19] ->rem. 3 -> [27, 24, 22, 19] -> safe
Line [19, 16, 15, 13, 10, 6, 6]  -> unsafe
Line [50, 49, 45, 43, 41, 38, 34]  -> unsafe
Line [48, 46, 45, 41, 34]  -> unsafe
Line [83, 80, 78, 77, 71, 68]  -> unsafe
Line [46, 44, 38, 37, 39]  -> unsafe
Line [39, 38, 37, 31, 29, 27, 27]  -> unsafe
Line [21, 19, 18, 16, 15, 9, 5]  -> unsafe
Line [81, 79, 78, 71, 69, 66, 63, 56]  -> unsafe
Line [69, 71, 68, 67, 66, 65] ->rem. 0 -> [71, 68, 67, 66, 65] -> safe
Line [11, 12, 11, 10, 7, 10]  -> unsafe
Line [83, 84, 83, 81, 78, 77, 75, 75]  -> unsafe
Line [19, 20, 18, 15, 14, 12, 11, 7]  -> unsafe
Line [80, 81, 80, 77, 75, 69]  -> unsafe
Line [17, 19, 20, 17, 16, 15]  -> unsafe
Line [45, 48, 47, 44, 41, 44, 41, 42]  -> unsafe
Line [40, 43, 41, 44, 44]  -> unsafe
Line [56, 57, 59, 57, 53]  -> unsafe
Line [93, 96, 99, 96, 93, 91, 88, 83]  -> unsafe
Line [79, 80, 78, 75, 73, 73, 72]  -> unsafe
Line [4, 7, 4, 4, 3, 4]  -> unsafe
Line [65, 66, 65, 65, 62, 60, 58, 58]  -> unsafe
Line [43, 45, 44, 44, 40]  -> unsafe
Line [81, 83, 82, 82, 81, 76]  -> unsafe
Line [92, 95, 91, 89, 88, 87] ->rem. 1 -> [92, 91, 89, 88, 87] -> safe
Line [30, 31, 27, 24, 26]  -> unsafe
Line [20, 22, 21, 18, 15, 11, 11]  -> unsafe
Line [31, 32, 31, 27, 26, 24, 21, 17]  -> unsafe
Line [43, 46, 45, 44, 42, 40, 36, 31]  -> unsafe
Line [47, 50, 48, 47, 46, 40, 37, 36]  -> unsafe
Line [23, 26, 24, 22, 16, 15, 12, 13]  -> unsafe
Line [86, 88, 86, 84, 81, 80, 75, 75]  -> unsafe
Line [88, 90, 88, 87, 82, 80, 76]  -> unsafe
Line [83, 85, 80, 77, 75, 70]  -> unsafe
Line [13, 13, 12, 10, 8, 5, 3, 1] ->rem. 0 -> [13, 12, 10, 8, 5, 3, 1] -> safe
Line [48, 48, 46, 44, 41, 43]  -> unsafe
Line [86, 86, 83, 81, 78, 78]  -> unsafe
Line [82, 82, 81, 80, 77, 73]  -> unsafe
Line [23, 23, 20, 19, 18, 16, 14, 7]  -> unsafe
Line [76, 76, 75, 73, 71, 73, 71]  -> unsafe
Line [41, 41, 39, 38, 35, 37, 39]  -> unsafe
Line [98, 98, 96, 94, 92, 93, 93]  -> unsafe
Line [49, 49, 48, 51, 47]  -> unsafe
Line [79, 79, 81, 80, 77, 75, 72, 67]  -> unsafe
Line [37, 37, 36, 35, 35, 32]  -> unsafe
Line [18, 18, 17, 15, 15, 13, 15]  -> unsafe
Line [6, 6, 6, 4, 4]  -> unsafe
Line [35, 35, 34, 33, 33, 29]  -> unsafe
Line [71, 71, 70, 70, 69, 67, 62]  -> unsafe
Line [91, 91, 89, 85, 82, 79, 77]  -> unsafe
Line [62, 62, 60, 56, 58]  -> unsafe
Line [16, 16, 14, 11, 7, 7]  -> unsafe
Line [88, 88, 86, 82, 78]  -> unsafe
Line [88, 88, 86, 85, 81, 78, 73]  -> unsafe
Line [21, 21, 19, 18, 11, 8]  -> unsafe
Line [12, 12, 6, 4, 6]  -> unsafe
Line [79, 79, 74, 71, 71]  -> unsafe
Line [65, 65, 60, 59, 55]  -> unsafe
Line [45, 45, 43, 40, 38, 33, 28]  -> unsafe
Line [44, 40, 37, 36, 34, 33, 32, 31] ->rem. 0 -> [40, 37, 36, 34, 33, 32, 31] -> safe
Line [15, 11, 8, 7, 9]  -> unsafe
Line [83, 79, 77, 74, 74]  -> unsafe
Line [68, 64, 62, 60, 59, 55]  -> unsafe
Line [77, 73, 71, 68, 67, 64, 61, 55]  -> unsafe
Line [56, 52, 50, 49, 47, 49, 48]  -> unsafe
Line [74, 70, 67, 70, 68, 66, 68]  -> unsafe
Line [56, 52, 54, 52, 49, 47, 47]  -> unsafe
Line [31, 27, 25, 26, 23, 21, 20, 16]  -> unsafe
Line [89, 85, 83, 86, 81]  -> unsafe
Line [38, 34, 34, 31, 28, 26, 24]  -> unsafe
Line [48, 44, 43, 40, 38, 38, 40]  -> unsafe
Line [23, 19, 19, 17, 16, 15, 15]  -> unsafe
Line [93, 89, 88, 87, 86, 86, 82]  -> unsafe
Line [91, 87, 85, 85, 82, 77]  -> unsafe
Line [58, 54, 50, 48, 46, 44, 41]  -> unsafe
Line [90, 86, 82, 80, 77, 76, 77]  -> unsafe
Line [83, 79, 77, 73, 73]  -> unsafe
Line [52, 48, 47, 43, 39]  -> unsafe
Line [38, 34, 30, 27, 21]  -> unsafe
Line [98, 94, 93, 92, 85, 82]  -> unsafe
Line [63, 59, 53, 51, 52]  -> unsafe
Line [69, 65, 63, 61, 56, 55, 55]  -> unsafe
Line [84, 80, 75, 74, 70]  -> unsafe
Line [68, 64, 58, 55, 54, 49]  -> unsafe
Line [28, 23, 22, 19, 17, 16] ->rem. 0 -> [23, 22, 19, 17, 16] -> safe
Line [27, 20, 19, 16, 14, 17]  -> unsafe
Line [78, 73, 72, 69, 66, 66]  -> unsafe
Line [23, 18, 16, 13, 11, 8, 7, 3]  -> unsafe
Line [29, 22, 19, 18, 15, 12, 10, 3]  -> unsafe
Line [26, 21, 23, 21, 18, 15, 13, 12] ->rem. 1 -> [26, 23, 21, 18, 15, 13, 12] -> safe
Line [48, 43, 44, 41, 38, 35, 36]  -> unsafe
Line [20, 15, 12, 10, 7, 9, 9]  -> unsafe
Line [37, 30, 28, 25, 23, 25, 21]  -> unsafe
Line [24, 18, 19, 16, 14, 7]  -> unsafe
Line [38, 31, 30, 30, 29, 26]  -> unsafe
Line [11, 5, 5, 2, 4]  -> unsafe
Line [74, 67, 64, 63, 62, 62, 60, 60]  -> unsafe
Line [95, 90, 88, 87, 87, 84, 80]  -> unsafe
Line [36, 29, 26, 25, 25, 22, 19, 13]  -> unsafe
Line [70, 64, 60, 59, 57, 56]  -> unsafe
Line [93, 87, 83, 80, 78, 77, 78]  -> unsafe
Line [77, 72, 68, 65, 65]  -> unsafe
Line [65, 58, 54, 53, 50, 48, 44]  -> unsafe
Line [91, 84, 80, 77, 75, 74, 69]  -> unsafe
Line [84, 77, 76, 71, 69, 68]  -> unsafe
Line [74, 67, 65, 59, 61]  -> unsafe
Line [58, 52, 50, 45, 45]  -> unsafe
Line [49, 43, 41, 40, 34, 33, 31, 27]  -> unsafe
Line [78, 71, 70, 63, 58]  -> unsafe
Line [32, 33, 36, 39, 37] ->rem. 3 -> [32, 33, 36, 37] -> safe
Line [29, 30, 32, 35, 36, 37, 38, 38] ->rem. 6 -> [29, 30, 32, 35, 36, 37, 38] -> safe
Line [5, 7, 9, 10, 13, 17] ->rem. 5 -> [5, 7, 9, 10, 13] -> safe
Line [36, 37, 39, 41, 42, 44, 50] ->rem. 6 -> [36, 37, 39, 41, 42, 44] -> safe
Line [62, 64, 65, 66, 69, 68, 71] ->rem. 4 -> [62, 64, 65, 66, 68, 71] -> safe
Line [27, 29, 26, 29, 31, 34, 32]  -> unsafe
Line [34, 37, 39, 40, 43, 41, 41]  -> unsafe
Line [36, 39, 42, 43, 45, 44, 45, 49]  -> unsafe
Line [78, 80, 81, 80, 82, 83, 89]  -> unsafe
Line [7, 9, 12, 12, 13, 16, 18] ->rem. 2 -> [7, 9, 12, 13, 16, 18] -> safe
Line [32, 35, 36, 36, 38, 35]  -> unsafe
Line [10, 11, 11, 13, 13]  -> unsafe
Line [43, 44, 44, 46, 48, 52]  -> unsafe
Line [49, 51, 53, 55, 56, 56, 63]  -> unsafe
Line [14, 16, 18, 20, 24, 27, 28, 29]  -> unsafe
Line [64, 65, 69, 70, 72, 73, 76, 73]  -> unsafe
Line [63, 66, 69, 70, 72, 76, 76]  -> unsafe
Line [33, 35, 39, 40, 41, 42, 46]  -> unsafe
Line [13, 15, 18, 21, 25, 32]  -> unsafe
Line [31, 33, 35, 36, 39, 44, 47]  -> unsafe
Line [56, 57, 62, 65, 66, 69, 66]  -> unsafe
Line [18, 21, 22, 23, 28, 28]  -> unsafe
Line [67, 68, 69, 72, 78, 82]  -> unsafe
Line [81, 83, 84, 89, 92, 99]  -> unsafe
Line [54, 51, 54, 55, 57, 58] ->rem. 0 -> [51, 54, 55, 57, 58] -> safe
Line [56, 54, 57, 59, 61, 62, 61]  -> unsafe
Line [62, 61, 63, 66, 67, 68, 68]  -> unsafe
Line [40, 37, 38, 40, 43, 46, 48, 52]  -> unsafe
Line [37, 34, 37, 38, 39, 42, 45, 52]  -> unsafe
Line [6, 4, 6, 9, 7, 8, 10]  -> unsafe
Line [31, 30, 32, 31, 28]  -> unsafe
Line [94, 92, 93, 96, 98, 97, 99, 99]  -> unsafe
Line [70, 69, 72, 71, 75]  -> unsafe
Line [18, 15, 17, 16, 23]  -> unsafe
Line [75, 72, 72, 75, 78, 81]  -> unsafe
Line [33, 30, 32, 32, 35, 36, 35]  -> unsafe
Line [51, 50, 52, 53, 53, 53]  -> unsafe
Line [53, 51, 54, 54, 58]  -> unsafe
Line [37, 34, 34, 35, 38, 45]  -> unsafe
Line [17, 14, 17, 21, 23, 24, 26]  -> unsafe
Line [71, 69, 72, 74, 78, 80, 82, 80]  -> unsafe
Line [15, 13, 17, 19, 19]  -> unsafe
Line [80, 78, 80, 84, 86, 90]  -> unsafe
Line [25, 22, 26, 29, 34]  -> unsafe
Line [83, 82, 88, 89, 92, 95, 96]  -> unsafe
Line [53, 51, 52, 53, 54, 60, 59]  -> unsafe
Line [35, 34, 39, 40, 41, 41]  -> unsafe
Line [65, 62, 67, 70, 73, 76, 79, 83]  -> unsafe
Line [82, 80, 82, 83, 88, 91, 97]  -> unsafe
Line [65, 65, 67, 69, 70, 73, 74, 75] ->rem. 0 -> [65, 67, 69, 70, 73, 74, 75] -> safe
Line [22, 22, 23, 25, 27, 26]  -> unsafe
Line [69, 69, 72, 75, 78, 81, 82, 82]  -> unsafe
Line [40, 40, 43, 44, 46, 49, 50, 54]  -> unsafe
Line [81, 81, 84, 87, 89, 96]  -> unsafe
Line [4, 4, 7, 4, 7, 10]  -> unsafe
Line [73, 73, 70, 73, 70]  -> unsafe
Line [86, 86, 87, 86, 86]  -> unsafe
Line [72, 72, 74, 73, 77]  -> unsafe
Line [7, 7, 9, 10, 7, 9, 11, 16]  -> unsafe
Line [54, 54, 57, 57, 58]  -> unsafe
Line [53, 53, 56, 57, 59, 62, 62, 59]  -> unsafe
Line [74, 74, 76, 76, 76]  -> unsafe
Line [80, 80, 82, 83, 83, 86, 90]  -> unsafe
Line [2, 2, 2, 4, 9]  -> unsafe
Line [88, 88, 90, 93, 97, 98, 99]  -> unsafe
Line [32, 32, 36, 37, 34]  -> unsafe
Line [72, 72, 74, 78, 78]  -> unsafe
Line [32, 32, 36, 37, 40, 41, 42, 46]  -> unsafe
Line [12, 12, 15, 19, 21, 26]  -> unsafe
Line [3, 3, 9, 10, 11, 13]  -> unsafe
Line [23, 23, 30, 32, 30]  -> unsafe
Line [58, 58, 65, 67, 69, 69]  -> unsafe
Line [39, 39, 42, 43, 49, 50, 51, 55]  -> unsafe
Line [9, 9, 10, 17, 19, 22, 27]  -> unsafe
Line [82, 86, 89, 92, 93, 96] ->rem. 0 -> [86, 89, 92, 93, 96] -> safe
Line [34, 38, 40, 42, 44, 46, 45]  -> unsafe
Line [22, 26, 28, 29, 29]  -> unsafe
Line [52, 56, 59, 62, 65, 66, 70]  -> unsafe
Line [61, 65, 68, 71, 74, 75, 77, 83]  -> unsafe
Line [38, 42, 39, 41, 44, 47, 50] ->rem. 1 -> [38, 39, 41, 44, 47, 50] -> safe
Line [63, 67, 68, 70, 68, 71, 68]  -> unsafe
Line [33, 37, 38, 36, 38, 38]  -> unsafe
Line [3, 7, 10, 12, 11, 14, 18]  -> unsafe
Line [21, 25, 27, 25, 27, 32]  -> unsafe
Line [45, 49, 49, 50, 52, 55]  -> unsafe
Line [27, 31, 33, 33, 34, 31]  -> unsafe
Line [8, 12, 13, 13, 15, 17, 17]  -> unsafe
Line [6, 10, 10, 11, 14, 16, 20]  -> unsafe
Line [65, 69, 72, 72, 75, 76, 82]  -> unsafe
Line [86, 90, 94, 96, 99]  -> unsafe
Line [47, 51, 55, 57, 60, 62, 59]  -> unsafe
Line [63, 67, 69, 72, 74, 78, 79, 79]  -> unsafe
Line [13, 17, 18, 22, 23, 27]  -> unsafe
Line [58, 62, 65, 66, 67, 71, 78]  -> unsafe
Line [66, 70, 72, 74, 76, 78, 83, 84]  -> unsafe
Line [27, 31, 32, 37, 40, 38]  -> unsafe
Line [57, 61, 63, 68, 68]  -> unsafe
Line [27, 31, 34, 36, 42, 43, 47]  -> unsafe
Line [38, 42, 43, 44, 46, 49, 55, 60]  -> unsafe
Line [4, 9, 11, 12, 14, 16] ->rem. 0 -> [9, 11, 12, 14, 16] -> safe
Line [20, 26, 27, 29, 32, 30]  -> unsafe
Line [75, 81, 84, 86, 87, 90, 90]  -> unsafe
Line [16, 22, 23, 26, 30]  -> unsafe
Line [9, 15, 16, 19, 22, 25, 28, 34]  -> unsafe
Line [26, 33, 32, 35, 38]  -> unsafe
Line [1, 8, 10, 12, 9, 6]  -> unsafe
Line [6, 12, 15, 13, 14, 16, 19, 19]  -> unsafe
Line [80, 85, 88, 89, 91, 93, 90, 94]  -> unsafe
Line [59, 65, 68, 69, 67, 73]  -> unsafe
Line [8, 14, 16, 18, 19, 21, 21, 24]  -> unsafe
Line [85, 90, 91, 92, 92, 93, 92]  -> unsafe
Line [32, 38, 38, 41, 43, 46, 47, 47]  -> unsafe
Line [53, 60, 61, 62, 62, 64, 67, 71]  -> unsafe
Line [67, 73, 75, 78, 78, 81, 88]  -> unsafe
Line [61, 67, 70, 74, 77, 78, 79, 80]  -> unsafe
Line [67, 74, 78, 79, 81, 80]  -> unsafe
Line [24, 29, 31, 35, 38, 38]  -> unsafe
Line [7, 12, 16, 19, 23]  -> unsafe
Line [13, 19, 20, 24, 27, 28, 29, 35]  -> unsafe
Line [53, 60, 63, 70, 72]  -> unsafe
Line [69, 75, 78, 79, 86, 88, 86]  -> unsafe
Line [3, 10, 12, 13, 20, 20]  -> unsafe
Line [31, 36, 39, 41, 46, 50]  -> unsafe
Line [64, 71, 77, 79, 82, 84, 90]  -> unsafe
Line [83, 80, 77, 74, 75] ->rem. 3 -> [83, 80, 77, 75] -> safe
Line [99, 97, 94, 92, 89, 86, 83, 83] ->rem. 6 -> [99, 97, 94, 92, 89, 86, 83] -> safe
Line [59, 57, 55, 53, 49] ->rem. 4 -> [59, 57, 55, 53] -> safe
Line [77, 75, 74, 73, 67] ->rem. 4 -> [77, 75, 74, 73] -> safe
Line [10, 8, 5, 4, 2, 4, 3, 1]  -> unsafe
Line [37, 34, 33, 36, 35, 34, 36]  -> unsafe
Line [55, 52, 51, 53, 53]  -> unsafe
Line [30, 27, 24, 23, 24, 23, 21, 17]  -> unsafe
Line [84, 83, 86, 85, 78]  -> unsafe
Line [36, 34, 33, 33, 31] ->rem. 2 -> [36, 34, 33, 31] -> safe
Line [19, 16, 16, 14, 13, 14]  -> unsafe
Line [80, 78, 76, 76, 76]  -> unsafe
Line [70, 68, 66, 64, 64, 61, 60, 56]  -> unsafe
Line [84, 81, 80, 79, 79, 73]  -> unsafe
Line [93, 91, 88, 84, 83]  -> unsafe
Line [63, 61, 57, 56, 53, 52, 50, 51]  -> unsafe
Line [85, 84, 80, 77, 77]  -> unsafe
Line [85, 84, 82, 81, 77, 74, 70]  -> unsafe
Line [21, 20, 16, 15, 12, 9, 2]  -> unsafe
Line [41, 39, 38, 32, 31, 28]  -> unsafe
Line [82, 81, 80, 74, 76]  -> unsafe
Line [64, 61, 55, 54, 53, 50, 50]  -> unsafe
Line [39, 36, 31, 28, 26, 22]  -> unsafe
Line [78, 75, 68, 65, 60]  -> unsafe
Line [96, 97, 95, 92, 89, 88, 86, 84] ->rem. 0 -> [97, 95, 92, 89, 88, 86, 84] -> safe
Line [97, 98, 96, 94, 97]  -> unsafe
Line [86, 89, 87, 84, 84]  -> unsafe
Line [58, 61, 58, 56, 52]  -> unsafe
Line [72, 73, 72, 70, 69, 68, 67, 60]  -> unsafe
Line [33, 34, 35, 32, 29, 28]  -> unsafe
Line [62, 65, 63, 61, 60, 59, 61, 63]  -> unsafe
Line [33, 36, 39, 36, 34, 31, 31]  -> unsafe
Line [48, 50, 49, 52, 50, 46]  -> unsafe
Line [17, 20, 22, 20, 19, 12]  -> unsafe
Line [65, 66, 65, 64, 64, 62, 59]  -> unsafe
Line [84, 85, 84, 84, 85]  -> unsafe
Line [31, 32, 31, 28, 26, 26, 26]  -> unsafe
Line [63, 66, 64, 61, 61, 58, 57, 53]  -> unsafe
Line [66, 69, 68, 66, 66, 60]  -> unsafe
Line [20, 23, 19, 16, 15] ->rem. 1 -> [20, 19, 16, 15] -> safe
Line [85, 86, 83, 81, 77, 74, 75]  -> unsafe
Line [49, 50, 48, 44, 44]  -> unsafe
Line [54, 57, 53, 51, 47]  -> unsafe
Line [45, 46, 42, 39, 38, 36, 29]  -> unsafe
Line [29, 32, 30, 29, 24, 21, 18, 17]  -> unsafe
Line [19, 22, 21, 16, 15, 13, 14]  -> unsafe
Line [76, 77, 72, 71, 68, 65, 64, 64]  -> unsafe
Line [86, 87, 85, 83, 77, 76, 72]  -> unsafe
Line [62, 63, 61, 60, 57, 54, 47, 41]  -> unsafe
Line [36, 36, 35, 33, 32, 30, 28, 25] ->rem. 0 -> [36, 35, 33, 32, 30, 28, 25] -> safe
Line [98, 98, 96, 93, 96]  -> unsafe
Line [72, 72, 71, 68, 67, 65, 62, 62]  -> unsafe
Line [29, 29, 26, 23, 21, 19, 17, 13]  -> unsafe
Line [41, 41, 39, 37, 36, 29]  -> unsafe
Line [36, 36, 33, 30, 27, 29, 28]  -> unsafe
Line [77, 77, 78, 75, 72, 71, 73]  -> unsafe
Line [56, 56, 53, 52, 49, 48, 50, 50]  -> unsafe
Line [75, 75, 77, 74, 70]  -> unsafe
Line [78, 78, 79, 77, 74, 73, 71, 66]  -> unsafe
Line [30, 30, 29, 26, 25, 22, 22, 19]  -> unsafe
Line [43, 43, 43, 41, 38, 36, 37]  -> unsafe
Line [18, 18, 18, 17, 16, 15, 13, 13]  -> unsafe
Line [55, 55, 52, 51, 48, 48, 44]  -> unsafe
Line [65, 65, 63, 63, 62, 60, 54]  -> unsafe
Line [58, 58, 54, 51, 50]  -> unsafe
Line [51, 51, 50, 46, 49]  -> unsafe
Line [63, 63, 62, 59, 57, 53, 53]  -> unsafe
Line [68, 68, 64, 61, 58, 55, 54, 50]  -> unsafe
Line [32, 32, 30, 27, 26, 22, 21, 15]  -> unsafe
Line [66, 66, 60, 57, 54, 51, 49, 47]  -> unsafe
Line [84, 84, 81, 78, 72, 75]  -> unsafe
Line [81, 81, 75, 74, 74]  -> unsafe
Line [49, 49, 46, 44, 42, 41, 35, 31]  -> unsafe
Line [41, 41, 39, 38, 32, 30, 23]  -> unsafe
Line [98, 94, 91, 88, 86, 85, 83] ->rem. 0 -> [94, 91, 88, 86, 85, 83] -> safe
Line [66, 62, 60, 58, 59]  -> unsafe
Line [66, 62, 59, 58, 58]  -> unsafe
Line [63, 59, 58, 55, 54, 53, 50, 46]  -> unsafe
Line [69, 65, 62, 59, 58, 55, 48]  -> unsafe
Line [37, 33, 36, 34, 31] ->rem. 1 -> [37, 36, 34, 31] -> safe
Line [53, 49, 48, 46, 44, 47, 49]  -> unsafe
Line [97, 93, 92, 94, 91, 89, 86, 86]  -> unsafe
Line [76, 72, 71, 70, 73, 72, 68]  -> unsafe
Line [39, 35, 33, 31, 34, 27]  -> unsafe
Line [70, 66, 65, 65, 64]  -> unsafe
Line [89, 85, 84, 83, 82, 80, 80, 81]  -> unsafe
Line [77, 73, 70, 68, 68, 68]  -> unsafe
Line [66, 62, 59, 58, 58, 57, 53]  -> unsafe
Line [43, 39, 36, 36, 33, 32, 25]  -> unsafe
Line [79, 75, 72, 70, 66, 65]  -> unsafe
Line [71, 67, 65, 62, 58, 56, 53, 55]  -> unsafe
Line [82, 78, 75, 71, 71]  -> unsafe
Line [40, 36, 32, 31, 29, 28, 27, 23]  -> unsafe
Line [91, 87, 86, 83, 82, 78, 72]  -> unsafe
Line [76, 72, 70, 69, 64, 63, 60, 57]  -> unsafe
Line [69, 65, 60, 57, 59]  -> unsafe
Line [24, 20, 18, 17, 14, 8, 8]  -> unsafe
Line [43, 39, 37, 34, 32, 31, 24, 20]  -> unsafe
Line [74, 70, 63, 62, 60, 54]  -> unsafe
Line [21, 16, 13, 12, 11, 10, 8] ->rem. 0 -> [16, 13, 12, 11, 10, 8] -> safe
Line [79, 73, 72, 69, 66, 63, 60, 61]  -> unsafe
Line [30, 25, 23, 21, 19, 19]  -> unsafe
Line [63, 57, 55, 52, 49, 47, 46, 42]  -> unsafe
Line [26, 19, 18, 17, 16, 14, 7]  -> unsafe
Line [60, 54, 56, 53, 52, 49]  -> unsafe
Line [42, 37, 36, 39, 38, 37, 35, 36]  -> unsafe
Line [81, 76, 79, 77, 74, 74]  -> unsafe
Line [27, 20, 19, 18, 15, 12, 15, 11]  -> unsafe
Line [58, 53, 52, 53, 50, 44]  -> unsafe
Line [17, 12, 10, 9, 8, 7, 7, 5]  -> unsafe
Line [26, 21, 20, 20, 21]  -> unsafe
Line [99, 93, 90, 87, 87, 84, 82, 82]  -> unsafe
Line [31, 24, 21, 18, 15, 12, 12, 8]  -> unsafe
Line [36, 31, 29, 27, 26, 26, 19]  -> unsafe
Line [32, 27, 26, 22, 20, 18]  -> unsafe
Line [75, 68, 64, 61, 59, 62]  -> unsafe
Line [22, 15, 13, 9, 9]  -> unsafe
Line [64, 58, 57, 53, 49]  -> unsafe
Line [47, 42, 40, 36, 33, 30, 28, 23]  -> unsafe
Line [19, 12, 10, 4, 3]  -> unsafe
Line [20, 14, 11, 10, 9, 7, 1, 4]  -> unsafe
Line [16, 10, 5, 4, 2, 2]  -> unsafe
Line [88, 83, 78, 75, 71]  -> unsafe
Line [98, 92, 87, 86, 83, 81, 75]  -> unsafe
Line [70, 72, 74, 77, 75] ->rem. 3 -> [70, 72, 74, 75] -> safe
Line [36, 38, 40, 43, 46, 46] ->rem. 4 -> [36, 38, 40, 43, 46] -> safe
Line [40, 42, 44, 45, 47, 48, 49, 53] ->rem. 7 -> [40, 42, 44, 45, 47, 48, 49] -> safe
Line [73, 75, 77, 80, 82, 89] ->rem. 5 -> [73, 75, 77, 80, 82] -> safe
Line [67, 69, 67, 68, 71]  -> unsafe
Line [80, 83, 85, 87, 89, 87, 84]  -> unsafe
Line [71, 73, 74, 71, 74, 74]  -> unsafe
Line [31, 34, 36, 33, 34, 35, 39]  -> unsafe
Line [77, 80, 79, 82, 83, 84, 90]  -> unsafe
Line [19, 22, 25, 25, 27, 28] ->rem. 2 -> [19, 22, 25, 27, 28] -> safe
Line [74, 76, 77, 77, 78, 79, 82, 79]  -> unsafe
Line [91, 94, 94, 95, 95]  -> unsafe
Line [66, 69, 70, 71, 71, 72, 76]  -> unsafe
Line [44, 47, 49, 52, 52, 58]  -> unsafe
Line [4, 6, 7, 11, 14, 16, 18]  -> unsafe
Line [80, 81, 85, 87, 89, 88]  -> unsafe
Line [81, 84, 86, 90, 93, 93]  -> unsafe
Line [5, 8, 10, 12, 14, 18, 22]  -> unsafe
Line [15, 16, 20, 21, 26]  -> unsafe
Line [16, 19, 24, 26, 27]  -> unsafe
Line [81, 83, 86, 88, 93, 94, 91]  -> unsafe
Line [61, 62, 63, 66, 71, 74, 74]  -> unsafe
Line [13, 14, 16, 23, 27]  -> unsafe
Line [46, 47, 53, 54, 57, 63]  -> unsafe
Line [34, 33, 36, 38, 41, 43, 46, 48] ->rem. 0 -> [33, 36, 38, 41, 43, 46, 48] -> safe
Line [50, 47, 49, 52, 55, 56, 58, 57]  -> unsafe
Line [10, 9, 10, 12, 12]  -> unsafe
Line [36, 33, 34, 35, 37, 39, 40, 44]  -> unsafe
Line [68, 66, 67, 69, 71, 74, 80]  -> unsafe
Line [83, 80, 81, 79, 80, 81]  -> unsafe
Line [78, 76, 78, 79, 78, 80, 83, 80]  -> unsafe
Line [56, 53, 56, 54, 57, 57]  -> unsafe
Line [31, 28, 29, 31, 30, 34]  -> unsafe
Line [62, 59, 56, 58, 63]  -> unsafe
Line [6, 5, 7, 7, 9]  -> unsafe
Line [22, 19, 21, 23, 23, 24, 21]  -> unsafe
Line [31, 28, 30, 33, 34, 36, 36, 36]  -> unsafe
Line [65, 64, 65, 68, 68, 70, 71, 75]  -> unsafe
Line [7, 6, 8, 11, 11, 12, 13, 18]  -> unsafe
Line [60, 58, 59, 61, 63, 65, 69, 72]  -> unsafe
Line [48, 46, 47, 49, 53, 51]  -> unsafe
Line [78, 77, 81, 84, 86, 88, 88]  -> unsafe
Line [15, 13, 15, 16, 19, 23, 27]  -> unsafe
Line [48, 46, 50, 52, 54, 55, 58, 63]  -> unsafe
Line [18, 16, 18, 19, 25, 27, 29]  -> unsafe
Line [71, 68, 69, 72, 73, 80, 82, 80]  -> unsafe
Line [68, 66, 68, 70, 77, 77]  -> unsafe
Line [75, 74, 76, 79, 85, 86, 90]  -> unsafe
Line [69, 67, 70, 72, 74, 81, 83, 89]  -> unsafe
Line [66, 66, 67, 70, 72, 73] ->rem. 0 -> [66, 67, 70, 72, 73] -> safe
Line [6, 6, 9, 11, 10]  -> unsafe
Line [15, 15, 16, 19, 19]  -> unsafe
Line [53, 53, 54, 57, 58, 62]  -> unsafe
Line [79, 79, 82, 85, 91]  -> unsafe
Line [25, 25, 23, 25, 28, 29]  -> unsafe
Line [1, 1, 3, 1, 4, 1]  -> unsafe
Line [80, 80, 81, 82, 80, 82, 85, 85]  -> unsafe
Line [36, 36, 38, 41, 40, 41, 45]  -> unsafe
Line [8, 8, 10, 13, 16, 13, 16, 21]  -> unsafe
Line [7, 7, 7, 10, 12, 13, 15, 18]  -> unsafe
Line [39, 39, 41, 43, 43, 46, 48, 45]  -> unsafe
Line [10, 10, 13, 13, 14, 17, 17]  -> unsafe
Line [71, 71, 72, 74, 76, 76, 80]  -> unsafe
Line [53, 53, 56, 59, 59, 65]  -> unsafe
Line [19, 19, 23, 26, 28, 29, 32]  -> unsafe
Line [67, 67, 68, 69, 71, 75, 74]  -> unsafe
Line [62, 62, 65, 69, 71, 73, 74, 74]  -> unsafe
Line [42, 42, 46, 48, 49, 51, 55]  -> unsafe
Line [47, 47, 51, 53, 56, 58, 63]  -> unsafe
Line [54, 54, 61, 64, 65]  -> unsafe
Line [77, 77, 84, 85, 87, 84]  -> unsafe
Line [15, 15, 20, 23, 24, 25, 25]  -> unsafe
Line [87, 87, 94, 95, 99]  -> unsafe
Line [17, 17, 22, 24, 29]  -> unsafe
Line [42, 46, 47, 49, 51, 54, 55, 57] ->rem. 0 -> [46, 47, 49, 51, 54, 55, 57] -> safe
Line [54, 58, 59, 62, 59]  -> unsafe
Line [60, 64, 66, 67, 69, 71, 73, 73]  -> unsafe
Line [6, 10, 11, 14, 15, 18, 22]  -> unsafe
Line [46, 50, 52, 55, 58, 61, 68]  -> unsafe
Line [13, 17, 20, 23, 22, 25, 28]  -> unsafe
Line [35, 39, 40, 43, 46, 45, 44]  -> unsafe
Line [24, 28, 31, 29, 32, 32]  -> unsafe
Line [24, 28, 30, 31, 30, 33, 36, 40]  -> unsafe
Line [75, 79, 80, 81, 78, 79, 85]  -> unsafe
Line [23, 27, 27, 29, 30]  -> unsafe
Line [47, 51, 52, 52, 53, 51]  -> unsafe
Line [34, 38, 38, 41, 43, 44, 46, 46]  -> unsafe
Line [61, 65, 66, 66, 70]  -> unsafe
Line [86, 90, 91, 91, 97]  -> unsafe
Line [5, 9, 11, 13, 15, 18, 22, 24]  -> unsafe
Line [70, 74, 77, 81, 83, 81]  -> unsafe
Line [5, 9, 12, 16, 19, 19]  -> unsafe
Line [61, 65, 66, 70, 72, 75, 79]  -> unsafe
Line [59, 63, 67, 70, 73, 78]  -> unsafe
Line [12, 16, 18, 24, 27]  -> unsafe
Line [19, 23, 25, 26, 28, 33, 36, 33]  -> unsafe
Line [78, 82, 87, 89, 91, 91]  -> unsafe
Line [76, 80, 83, 88, 92]  -> unsafe
Line [8, 12, 14, 21, 28]  -> unsafe
Line [24, 29, 30, 32, 33, 34, 36] ->rem. 0 -> [29, 30, 32, 33, 34, 36] -> safe
Line [51, 58, 60, 61, 62, 63, 61]  -> unsafe
Line [38, 45, 47, 50, 50]  -> unsafe
Line [57, 63, 64, 66, 67, 68, 72]  -> unsafe
Line [6, 12, 14, 15, 18, 20, 26]  -> unsafe
Line [5, 10, 9, 12, 14]  -> unsafe
Line [50, 55, 52, 53, 51]  -> unsafe
Line [16, 21, 18, 20, 23, 25, 25]  -> unsafe
Line [9, 14, 11, 14, 18]  -> unsafe
Line [72, 79, 80, 82, 80, 81, 82, 87]  -> unsafe
Line [85, 91, 92, 92, 93, 94]  -> unsafe
Line [85, 91, 91, 93, 92]  -> unsafe
Line [3, 8, 10, 10, 11, 11]  -> unsafe
Line [12, 19, 19, 21, 25]  -> unsafe
Line [40, 47, 48, 51, 52, 54, 54, 61]  -> unsafe
Line [78, 83, 84, 88, 90, 92, 93, 95]  -> unsafe
Line [48, 54, 57, 61, 58]  -> unsafe
Line [76, 81, 82, 85, 89, 89]  -> unsafe
Line [56, 63, 64, 65, 68, 72, 76]  -> unsafe
Line [64, 71, 72, 75, 76, 80, 85]  -> unsafe
Line [38, 45, 50, 53, 54, 56]  -> unsafe
Line [56, 61, 62, 67, 69, 70, 67]  -> unsafe
Line [45, 51, 54, 59, 60, 62, 64, 64]  -> unsafe
Line [2, 8, 11, 18, 19, 23]  -> unsafe
Line [60, 67, 70, 71, 73, 80, 82, 89]  -> unsafe
Line [65, 63, 61, 59, 60] ->rem. 3 -> [65, 63, 61, 60] -> safe
Line [85, 82, 79, 76, 73, 71, 69, 69] ->rem. 6 -> [85, 82, 79, 76, 73, 71, 69] -> safe
Line [18, 17, 14, 11, 8, 6, 5, 1] ->rem. 7 -> [18, 17, 14, 11, 8, 6, 5] -> safe
Line [20, 18, 16, 15, 13, 12, 7] ->rem. 6 -> [20, 18, 16, 15, 13, 12] -> safe
Line [61, 60, 58, 56, 53, 54, 51] ->rem. 4 -> [61, 60, 58, 56, 54, 51] -> safe
Line [54, 51, 54, 52, 51, 52]  -> unsafe
Line [14, 12, 11, 8, 11, 8, 7, 7]  -> unsafe
Line [81, 78, 77, 76, 78, 75, 72, 68]  -> unsafe
Line [17, 15, 13, 12, 15, 10] ->rem. 4 -> [17, 15, 13, 12, 10] -> safe
Line [44, 43, 41, 39, 39, 38, 37] ->rem. 3 -> [44, 43, 41, 39, 38, 37] -> safe
Line [63, 61, 58, 57, 57, 55, 56]  -> unsafe
Line [82, 80, 79, 77, 75, 73, 73, 73]  -> unsafe
Line [98, 95, 92, 92, 88]  -> unsafe
Line [54, 52, 52, 51, 49, 46, 41]  -> unsafe
Line [16, 15, 14, 12, 8, 6, 5]  -> unsafe
Line [44, 41, 37, 36, 37]  -> unsafe
Line [39, 36, 34, 32, 28, 27, 24, 24]  -> unsafe
Line [94, 92, 89, 85, 84, 80]  -> unsafe
Line [61, 60, 56, 54, 51, 49, 48, 42]  -> unsafe
Line [50, 48, 42, 41, 39]  -> unsafe
Line [92, 90, 89, 87, 80, 82]  -> unsafe
Line [57, 54, 48, 45, 44, 41, 39, 39]  -> unsafe
Line [67, 66, 64, 59, 57, 53]  -> unsafe
Line [49, 47, 45, 38, 36, 35, 30]  -> unsafe
Line [97, 98, 95, 93, 90, 89, 87, 86] ->rem. 0 -> [98, 95, 93, 90, 89, 87, 86] -> safe
Line [24, 26, 24, 21, 24]  -> unsafe
Line [37, 39, 37, 36, 33, 30, 30]  -> unsafe
Line [61, 63, 60, 59, 58, 54]  -> unsafe
Line [63, 66, 64, 62, 56]  -> unsafe
Line [68, 71, 70, 72, 71, 70]  -> unsafe
Line [88, 89, 92, 91, 89, 91]  -> unsafe
Line [28, 29, 28, 27, 30, 28, 28]  -> unsafe
Line [21, 22, 24, 22, 20, 19, 15]  -> unsafe
Line [91, 92, 95, 92, 85]  -> unsafe
Line [68, 71, 70, 69, 68, 68, 66, 63]  -> unsafe
Line [73, 76, 73, 72, 70, 67, 67, 70]  -> unsafe
Line [38, 41, 38, 38, 37, 37]  -> unsafe
Line [71, 73, 72, 72, 71, 68, 65, 61]  -> unsafe
Line [17, 19, 16, 15, 15, 14, 7]  -> unsafe
Line [38, 40, 37, 35, 34, 30, 28, 27]  -> unsafe
Line [11, 12, 10, 8, 4, 6]  -> unsafe
Line [89, 92, 91, 88, 84, 81, 81]  -> unsafe
Line [80, 81, 79, 76, 72, 68]  -> unsafe
Line [51, 52, 50, 48, 44, 39]  -> unsafe
Line [35, 37, 34, 27, 25]  -> unsafe
Line [60, 63, 61, 56, 55, 58]  -> unsafe
Line [47, 48, 43, 42, 39, 39]  -> unsafe
Line [24, 26, 19, 17, 13]  -> unsafe
Line [68, 69, 67, 62, 60, 53]  -> unsafe
Line [95, 95, 94, 92, 89] ->rem. 0 -> [95, 94, 92, 89] -> safe
Line [80, 80, 77, 76, 74, 72, 70, 72]  -> unsafe
Line [81, 81, 78, 75, 75]  -> unsafe
Line [99, 99, 98, 97, 96, 95, 93, 89]  -> unsafe
Line [16, 16, 14, 13, 12, 7]  -> unsafe
Line [98, 98, 95, 92, 90, 93, 92]  -> unsafe
Line [92, 92, 95, 92, 89, 92]  -> unsafe
Line [41, 41, 38, 41, 40, 40]  -> unsafe
Line [50, 50, 48, 50, 46]  -> unsafe
Line [21, 21, 22, 19, 16, 14, 9]  -> unsafe
Line [49, 49, 49, 47, 44, 41, 38]  -> unsafe
Line [74, 74, 72, 71, 71, 72]  -> unsafe
Line [10, 10, 8, 6, 3, 3, 2, 2]  -> unsafe
Line [71, 71, 69, 66, 65, 65, 63, 59]  -> unsafe
Line [81, 81, 81, 80, 75]  -> unsafe
Line [20, 20, 16, 14, 13]  -> unsafe
Line [46, 46, 42, 40, 39, 38, 39]  -> unsafe
Line [9, 9, 8, 7, 3, 3]  -> unsafe
Line [76, 76, 72, 71, 69, 68, 67, 63]  -> unsafe
Line [47, 47, 46, 44, 40, 39, 34]  -> unsafe
Line [25, 25, 22, 21, 16, 14]  -> unsafe
Line [78, 78, 72, 71, 68, 67, 70]  -> unsafe
Line [26, 26, 20, 17, 17]  -> unsafe
Line [21, 21, 14, 11, 10, 6]  -> unsafe
Line [63, 63, 56, 55, 53, 51, 50, 43]  -> unsafe
Line [95, 91, 90, 88, 86, 84, 83, 81] ->rem. 0 -> [91, 90, 88, 86, 84, 83, 81] -> safe
Line [54, 50, 48, 46, 43, 45]  -> unsafe
Line [84, 80, 78, 76, 76]  -> unsafe
Line [44, 40, 37, 36, 34, 30]  -> unsafe
Line [32, 28, 26, 25, 23, 18]  -> unsafe
Line [29, 25, 24, 23, 24, 22, 21, 20]  -> unsafe
Line [77, 73, 70, 67, 70, 68, 69]  -> unsafe
Line [60, 56, 58, 56, 54, 53, 51, 51]  -> unsafe
Line [92, 88, 85, 84, 86, 82]  -> unsafe
Line [62, 58, 55, 53, 52, 54, 53, 46]  -> unsafe
Line [45, 41, 41, 38, 37, 35]  -> unsafe
Line [38, 34, 31, 31, 33]  -> unsafe
Line [71, 67, 65, 65, 65]  -> unsafe
Line [27, 23, 20, 18, 15, 15, 11]  -> unsafe
Line [82, 78, 78, 75, 74, 71, 70, 64]  -> unsafe
Line [80, 76, 74, 72, 70, 66, 65]  -> unsafe
Line [56, 52, 51, 47, 46, 43, 41, 44]  -> unsafe
Line [71, 67, 65, 61, 61]  -> unsafe
Line [81, 77, 74, 73, 69, 65]  -> unsafe
Line [98, 94, 92, 91, 88, 84, 79]  -> unsafe
Line [41, 37, 35, 30, 27]  -> unsafe
Line [88, 84, 81, 80, 75, 77]  -> unsafe
Line [34, 30, 27, 25, 24, 19, 19]  -> unsafe
Line [54, 50, 48, 45, 43, 38, 36, 32]  -> unsafe
Line [64, 60, 59, 54, 52, 45]  -> unsafe
Line [93, 88, 86, 85, 82] ->rem. 0 -> [88, 86, 85, 82] -> safe
Line [54, 47, 46, 43, 46]  -> unsafe
Line [26, 21, 19, 18, 18]  -> unsafe
Line [24, 18, 15, 13, 12, 9, 6, 2]  -> unsafe
Line [73, 68, 66, 63, 60, 57, 54, 49]  -> unsafe
Line [62, 56, 55, 56, 54, 51, 50]  -> unsafe
Line [65, 58, 56, 59, 57, 54, 52, 55]  -> unsafe
Line [92, 87, 86, 85, 82, 85, 85]  -> unsafe
Line [15, 9, 7, 10, 6]  -> unsafe
Line [73, 66, 63, 62, 61, 64, 59]  -> unsafe
Line [77, 71, 70, 67, 67, 66, 63]  -> unsafe
Line [65, 60, 57, 55, 55, 53, 56]  -> unsafe
Line [76, 70, 70, 68, 66, 65, 62, 62]  -> unsafe
Line [37, 30, 28, 28, 27, 25, 22, 18]  -> unsafe
Line [43, 38, 35, 35, 32, 25]  -> unsafe
Line [93, 87, 83, 81, 79, 76]  -> unsafe
Line [72, 66, 62, 61, 60, 57, 60]  -> unsafe
Line [78, 73, 69, 67, 67]  -> unsafe
Line [96, 90, 87, 83, 79]  -> unsafe
Line [53, 46, 45, 41, 35]  -> unsafe
Line [74, 68, 66, 61, 58]  -> unsafe
Line [96, 90, 84, 81, 79, 76, 79]  -> unsafe
Line [90, 83, 82, 77, 76, 76]  -> unsafe
Line [98, 92, 86, 83, 82, 78]  -> unsafe
Line [63, 58, 55, 54, 52, 45, 44, 38]  -> unsafe
Line [66, 71, 71, 72, 74, 75, 77]  -> unsafe
Line [6, 4, 6, 10, 13, 14, 14]  -> unsafe
Line [42, 40, 39, 36, 31, 25]  -> unsafe
Line [45, 44, 46, 45, 44, 43, 42, 38]  -> unsafe
Line [37, 39, 40, 43, 45, 46, 46] ->rem. 5 -> [37, 39, 40, 43, 45, 46] -> safe
Line [15, 11, 8, 7, 3, 1, 3]  -> unsafe
Line [53, 53, 52, 51, 47]  -> unsafe
Line [24, 19, 18, 13, 7]  -> unsafe
Line [39, 35, 34, 33, 30, 27, 20]  -> unsafe
Line [32, 32, 30, 26, 29]  -> unsafe
Line [75, 75, 80, 83, 85, 88, 88]  -> unsafe
Line [26, 26, 30, 32, 33, 34, 37]  -> unsafe
Line [46, 46, 48, 47, 42]  -> unsafe
Line [46, 41, 39, 36, 32, 31, 27]  -> unsafe
Line [91, 88, 86, 83, 80, 73] ->rem. 5 -> [91, 88, 86, 83, 80] -> safe
Line [71, 67, 66, 63, 59]  -> unsafe
Line [41, 45, 47, 46, 47, 50, 51]  -> unsafe
Line [43, 37, 35, 36, 32]  -> unsafe
Line [8, 9, 10, 10, 12, 13, 15, 20]  -> unsafe
Line [28, 28, 29, 30, 30, 31, 34, 38]  -> unsafe
Line [66, 69, 66, 63, 65, 66]  -> unsafe
Line [98, 94, 91, 87, 86, 86]  -> unsafe
Line [35, 34, 33, 33, 32] ->rem. 2 -> [35, 34, 33, 32] -> safe
Line [9, 6, 6, 7, 8, 13]  -> unsafe
Line [7, 10, 12, 15, 17, 19, 24, 24]  -> unsafe
Line [52, 48, 51, 49, 43]  -> unsafe
Line [97, 98, 91, 88, 85, 83, 82, 78]  -> unsafe
Line [79, 79, 78, 75, 70, 70]  -> unsafe
Line [47, 43, 40, 39, 36, 32, 28]  -> unsafe
Line [11, 8, 7, 4, 1, 1] ->rem. 4 -> [11, 8, 7, 4, 1] -> safe
Line [37, 36, 39, 39, 41, 42, 45, 47]  -> unsafe
Line [58, 58, 58, 57, 54, 53, 50, 48]  -> unsafe
Line [25, 25, 24, 23, 18]  -> unsafe
Line [49, 47, 44, 38, 37, 36, 34, 36]  -> unsafe
Line [33, 32, 37, 38, 40, 42, 43]  -> unsafe
Line [12, 19, 24, 25, 26]  -> unsafe
Line [38, 40, 41, 42, 45, 46, 49, 55] ->rem. 7 -> [38, 40, 41, 42, 45, 46, 49] -> safe
Line [64, 60, 57, 56, 56, 54, 51, 49]  -> unsafe
Line [47, 47, 49, 52, 53, 60, 62, 67]  -> unsafe
Line [28, 31, 27, 24, 21, 19, 22]  -> unsafe
Line [38, 45, 48, 51, 51, 56]  -> unsafe
Line [73, 70, 70, 68, 64]  -> unsafe
Line [82, 82, 81, 79, 77, 72, 73]  -> unsafe
Line [43, 45, 48, 50, 53, 56, 58, 59] -> safe
Line [60, 63, 64, 67, 68, 69, 72] -> safe
Line [72, 74, 77, 79, 81, 84] -> safe
Line [60, 57, 55, 54, 52, 50, 47] -> safe
Line [57, 54, 52, 50, 47, 44] -> safe
Line [8, 9, 11, 14, 15] -> safe
Line [82, 79, 77, 74, 71, 68, 66] -> safe
Line [34, 31, 30, 29, 26, 23, 21] -> safe
Line [10, 13, 14, 17, 18, 21, 22, 23] -> safe
Line [79, 77, 76, 73, 71, 70] -> safe
Line [87, 89, 92, 93, 96, 97] -> safe
Line [82, 81, 80, 78, 77, 76, 73, 72] -> safe
Line [22, 19, 16, 14, 13] -> safe
Line [79, 80, 82, 83, 84, 86, 88] -> safe
Line [76, 78, 80, 82, 83] -> safe
Line [15, 18, 19, 20, 23, 24, 27] -> safe
Line [65, 67, 68, 71, 73, 75, 77, 79] -> safe
Line [42, 41, 40, 39, 38] -> safe
Line [33, 34, 37, 38, 41, 44, 46] -> safe
Line [69, 72, 75, 76, 78, 81] -> safe
Line [90, 87, 86, 85, 83] -> safe
Line [57, 56, 54, 53, 50, 49, 47, 45] -> safe
Line [67, 65, 62, 61, 59, 56, 55] -> safe
Line [23, 25, 27, 29, 32, 33] -> safe
Line [70, 67, 66, 63, 60, 57, 55] -> safe
Line [90, 88, 85, 83, 82, 79, 76, 73] -> safe
Line [91, 88, 86, 83, 80, 79, 76, 73] -> safe
Line [37, 35, 32, 31, 28, 26, 25, 22] -> safe
Line [22, 23, 25, 27, 28, 29, 32] -> safe
Line [96, 93, 90, 89, 88] -> safe
Line [59, 57, 56, 55, 54] -> safe
Line [38, 37, 35, 32, 31] -> safe
Line [11, 10, 7, 6, 5, 3] -> safe
Line [51, 50, 48, 45, 42, 40, 38, 35] -> safe
Line [69, 68, 65, 64, 63, 61, 59, 58] -> safe
Line [45, 42, 39, 37, 36, 34, 32] -> safe
Line [3, 4, 7, 8, 9] -> safe
Line [43, 46, 48, 49, 50, 53, 54, 55] -> safe
Line [35, 37, 40, 43, 46] -> safe
Line [46, 44, 41, 38, 36, 33] -> safe
Line [15, 13, 10, 7, 5, 2] -> safe
Line [13, 11, 10, 9, 8, 7, 6] -> safe
Line [40, 43, 46, 47, 48, 51] -> safe
Line [70, 71, 74, 76, 79] -> safe
Line [59, 58, 56, 55, 52, 49] -> safe
Line [86, 89, 91, 92, 95, 97, 98] -> safe
Line [85, 88, 90, 92, 93] -> safe
Line [63, 62, 59, 57, 55, 52, 50] -> safe
Line [77, 74, 72, 70, 68, 67] -> safe
Line [50, 47, 45, 44, 41, 38, 36] -> safe
Line [82, 84, 85, 88, 90, 91, 94, 97] -> safe
Line [13, 15, 16, 18, 20, 23, 26, 28] -> safe
Line [61, 63, 65, 68, 70, 72, 75, 76] -> safe
Line [80, 81, 82, 83, 85] -> safe
Line [73, 71, 68, 67, 66, 65, 62] -> safe
Line [45, 48, 50, 53, 56, 58, 59, 62] -> safe
Line [9, 10, 13, 16, 19, 22, 23, 26] -> safe
Line [40, 39, 36, 34, 31, 30, 27, 25] -> safe
Line [90, 88, 86, 83, 82, 81] -> safe
Line [29, 31, 33, 35, 38, 41, 44] -> safe
Line [57, 54, 53, 51, 49, 46, 43] -> safe
Line [89, 87, 85, 84, 83, 82] -> safe
Line [43, 41, 38, 35, 34, 33, 31, 30] -> safe
Line [26, 23, 22, 21, 18, 16, 14] -> safe
Line [80, 81, 82, 84, 87] -> safe
Line [42, 43, 45, 48, 50, 51, 53, 55] -> safe
Line [15, 12, 10, 8, 5, 4] -> safe
Line [36, 34, 31, 29, 28, 27] -> safe
Line [15, 13, 12, 9, 6, 3] -> safe
Line [54, 51, 50, 49, 47] -> safe
Line [40, 43, 46, 47, 48, 51, 53] -> safe
Line [38, 36, 33, 32, 31, 28, 26, 23] -> safe
Line [65, 64, 61, 59, 57, 55] -> safe
Line [84, 83, 81, 79, 78, 77] -> safe
Line [12, 15, 16, 18, 20] -> safe
Line [37, 38, 40, 43, 46, 48, 50] -> safe
Line [20, 21, 22, 23, 24, 25, 27] -> safe
Line [82, 83, 84, 87, 89] -> safe
Line [30, 32, 34, 37, 39, 42, 45, 48] -> safe
Line [87, 85, 83, 80, 77, 74] -> safe
Line [65, 66, 69, 70, 71] -> safe
Line [76, 79, 80, 83, 86, 87] -> safe
Line [5, 8, 11, 14, 15] -> safe
Line [6, 8, 10, 13, 16, 19] -> safe
Line [18, 15, 14, 12, 10] -> safe
Line [71, 72, 75, 77, 79, 81, 82, 83] -> safe
Line [33, 30, 28, 26, 24, 22] -> safe
Line [67, 68, 69, 71, 72, 73] -> safe
Line [89, 90, 93, 94, 97] -> safe
Line [25, 22, 21, 19, 16, 13] -> safe
Line [70, 68, 66, 64, 63, 60] -> safe
Line [26, 27, 29, 31, 32, 35, 38] -> safe
Line [22, 24, 26, 27, 29, 32, 33, 34] -> safe
Line [25, 27, 29, 30, 33, 36, 39] -> safe
Line [56, 53, 51, 50, 48, 47, 46] -> safe
Line [20, 22, 23, 24, 26, 27, 28] -> safe
Line [24, 27, 29, 31, 34] -> safe
Line [86, 83, 81, 78, 76, 75, 72, 71] -> safe
Line [33, 35, 36, 39, 40, 41, 43] -> safe
Line [13, 14, 16, 19, 21, 23] -> safe
Line [64, 61, 58, 56, 54, 53, 51, 49] -> safe
Line [25, 28, 31, 33, 34, 36] -> safe
Line [79, 77, 75, 72, 69, 66, 65] -> safe
Line [85, 87, 90, 92, 93, 95, 96] -> safe
Line [40, 42, 44, 47, 49, 52, 54] -> safe
Line [39, 38, 35, 34, 33, 32, 29] -> safe
Line [29, 30, 33, 35, 38, 40, 42] -> safe
Line [96, 93, 92, 90, 88, 87, 85] -> safe
Line [50, 52, 53, 54, 57, 60] -> safe
Line [29, 28, 25, 22, 19, 17] -> safe
Line [55, 54, 53, 52, 50, 48] -> safe
Line [27, 26, 23, 20, 17, 16] -> safe
Line [60, 63, 65, 67, 70, 72, 73, 75] -> safe
Line [31, 28, 26, 24, 23, 22] -> safe
Line [50, 47, 46, 44, 43] -> safe
Line [30, 31, 33, 36, 37, 40, 43] -> safe
Line [79, 78, 76, 74, 73, 70, 67] -> safe
Line [51, 52, 53, 56, 58, 60, 61] -> safe
Line [83, 82, 79, 76, 74, 72, 71, 68] -> safe
Line [33, 34, 35, 37, 40, 42, 45] -> safe
Line [81, 82, 85, 86, 87, 90] -> safe
Line [94, 93, 92, 91, 89, 87, 85, 83] -> safe
Line [12, 14, 16, 19, 21, 23] -> safe
Line [3, 5, 8, 11, 13, 15, 17] -> safe
Line [82, 80, 77, 75, 74] -> safe
Line [28, 30, 31, 34, 36, 38] -> safe
Line [83, 80, 78, 77, 76, 75, 74, 71] -> safe
Line [47, 49, 52, 54, 56, 59, 60] -> safe
Line [45, 43, 40, 39, 38, 35, 33, 30] -> safe
Line [9, 7, 6, 5, 4, 3] -> safe
Line [15, 18, 21, 22, 24, 27] -> safe
Line [19, 21, 24, 27, 30, 32, 33] -> safe
Line [30, 27, 25, 22, 19] -> safe
Line [38, 37, 34, 31, 29, 27, 24, 22] -> safe
Line [74, 77, 79, 81, 82, 83, 85, 86] -> safe
Line [81, 79, 78, 77, 75, 73] -> safe
Line [52, 51, 50, 49, 47, 44, 43] -> safe
Line [15, 12, 9, 7, 4, 2, 1] -> safe
Line [32, 29, 26, 23, 21, 18, 15] -> safe
Line [6, 7, 10, 12, 13, 16] -> safe
Line [22, 24, 25, 27, 28, 31, 33] -> safe
Line [9, 12, 15, 16, 19, 21, 23] -> safe
Line [23, 21, 20, 19, 18, 15, 12, 10] -> safe
Line [50, 52, 55, 58, 59] -> safe
Line [2, 3, 6, 8, 10, 12, 15, 18] -> safe
Line [94, 91, 88, 87, 84] -> safe
Line [54, 52, 51, 49, 48, 46, 45] -> safe
Line [82, 85, 86, 89, 90] -> safe
Line [21, 19, 17, 15, 14, 11] -> safe
Line [53, 56, 59, 62, 64] -> safe
Line [3, 6, 8, 11, 13, 14] -> safe
Line [83, 85, 88, 90, 92] -> safe
Line [60, 57, 55, 54, 52, 49, 48] -> safe
Line [77, 74, 73, 70, 68, 66, 63] -> safe
Line [22, 25, 27, 30, 31, 33, 34] -> safe
Line [31, 33, 34, 35, 36, 39] -> safe
Line [84, 83, 81, 80, 79, 78] -> safe
Line [20, 23, 26, 27, 28, 31, 32, 34] -> safe
Line [15, 16, 18, 19, 22, 25, 26] -> safe
Line [99, 97, 96, 94, 92, 90] -> safe
Line [73, 72, 70, 68, 67, 66, 63, 61] -> safe
Line [65, 63, 62, 61, 58, 56, 55, 52] -> safe
Line [78, 79, 81, 84, 85, 88, 91, 92] -> safe
Line [74, 71, 68, 67, 65] -> safe
Line [46, 49, 51, 53, 56, 57] -> safe
Line [21, 22, 23, 24, 25, 26] -> safe
Line [33, 35, 38, 40, 41, 44, 47] -> safe
Line [88, 91, 92, 93, 96] -> safe
Line [25, 28, 30, 33, 35] -> safe
Line [89, 92, 95, 96, 97] -> safe
Line [92, 90, 88, 85, 82, 79, 78, 77] -> safe
Line [77, 80, 81, 84, 86, 89, 90, 92] -> safe
Line [74, 76, 78, 80, 81, 83, 84] -> safe
Line [75, 74, 71, 69, 68, 65] -> safe
Line [17, 16, 13, 10, 9] -> safe
Line [10, 12, 15, 18, 19] -> safe
Line [47, 49, 52, 54, 55] -> safe
Line [91, 88, 87, 85, 84] -> safe
Line [52, 51, 49, 48, 46, 43, 40, 37] -> safe
Line [86, 84, 83, 81, 78, 75] -> safe
Line [11, 13, 15, 18, 20, 21, 23, 25] -> safe
Line [94, 93, 91, 88, 86, 84, 81] -> safe
Line [71, 70, 67, 65, 64] -> safe
Line [41, 44, 45, 47, 48] -> safe
Line [77, 80, 82, 84, 87] -> safe
Line [98, 95, 93, 92, 90, 88] -> safe
Line [76, 79, 81, 82, 84, 85, 87, 90] -> safe
Line [52, 50, 49, 47, 44, 41, 39] -> safe
Line [84, 85, 88, 89, 91, 94, 97, 98] -> safe
Line [76, 79, 80, 81, 83, 84, 86, 88] -> safe
Line [21, 23, 26, 27, 29] -> safe
Line [94, 93, 90, 87, 85, 84, 81] -> safe
Line [76, 77, 80, 83, 85, 88, 90, 93] -> safe
Line [56, 53, 50, 47, 44, 43, 41, 40] -> safe
Line [78, 81, 82, 85, 87] -> safe
Line [86, 87, 89, 90, 93] -> safe
Line [92, 90, 89, 88, 86, 85] -> safe
Line [45, 44, 43, 42, 39] -> safe
Line [75, 72, 71, 69, 66, 64, 62] -> safe
Line [75, 73, 71, 69, 67, 65, 63, 60] -> safe
Line [14, 16, 18, 19, 20, 21] -> safe
Line [77, 74, 72, 70, 69, 67] -> safe
Line [46, 45, 42, 41, 39, 37, 36, 35] -> safe
Line [20, 18, 16, 13, 10, 7, 6, 3] -> safe
Line [64, 66, 69, 71, 72, 75] -> safe
Line [16, 18, 21, 23, 24, 25, 26, 28] -> safe
Line [61, 59, 57, 56, 54, 52, 50] -> safe
Line [44, 45, 48, 51, 54, 57, 58, 60] -> safe
Line [25, 28, 31, 32, 35] -> safe
Line [79, 78, 76, 73, 71, 70] -> safe
Line [64, 65, 68, 71, 73, 74] -> safe
Line [58, 60, 63, 64, 67] -> safe
Line [33, 35, 36, 37, 39, 41] -> safe


285
#+end_example

